
## Plan Result




<pre><code>Plan: 103 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.libra_dtu_app_insights
  * azurerm_application_insights.rota_dtu_app_insights
  * azurerm_automation_account.automation_account
  * azurerm_key_vault_access_policy.apim_kv_policy
  * azurerm_key_vault_access_policy.policy
  * azurerm_role_assignment.mi_sa[&#34;Contributor&#34;]
  * azurerm_role_assignment.mi_sa[&#34;Storage Blob Data Contributor&#34;]
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_runbook.main
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-id&#34;]
  * module.cft_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-cft-client-pwd&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-id&#34;]
  * module.crime_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;cft-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-apim-cert&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;crime-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;elinks-client-token&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;health-check-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-base-64&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-crime-cert-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-ctx&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-emulator-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-gateway-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-auth&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-servicenow-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;pip-client-scope&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-assignment-group&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-caller-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-password&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-role-type&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-service-offering&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-username&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;snl-client-pwd&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;tenant-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-OAuth-url&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-host&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-id&#34;]
  * module.hmi_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;vh-client-pwd&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-libra-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;mi-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;sa-name&#34;]
  * module.kv_cft.azurerm_key_vault.kv
  * module.kv_cft.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_cft.azurerm_key_vault_access_policy.developer[0]
  * module.kv_cft.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_key_vault.kv
  * module.kv_crime.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_crime.azurerm_key_vault_access_policy.developer[0]
  * module.kv_crime.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_key_vault.kv
  * module.kv_hmi.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_hmi.azurerm_key_vault_access_policy.developer[0]
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
  * module.kv_hmi.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_key_vault.kv
  * module.kv_rota.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_rota.azurerm_key_vault_access_policy.developer[0]
  * module.kv_rota.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_key_vault.kv
  * module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy
  * module.kv_snl.azurerm_key_vault_access_policy.developer[0]
  * module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Reader&#34;]
  * module.sa.azurerm_storage_account.storage_account
  * module.sa.azurerm_storage_container.container[&#34;libra&#34;]
  * module.sa.azurerm_storage_container.container[&#34;processing&#34;]
  * module.sa.azurerm_storage_container.container[&#34;rota&#34;]
  * module.sa.random_string.storage_account_random_string
  * module.sa.time_rotating.rotate
  * module.sa.time_static.pim_expiry
  * module.sa.time_static.pim_start
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-id&#34;]
  * module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-snl-client-pwd&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.libra_dtu_app_insights will be created
  + resource "azurerm_application_insights" "libra_dtu_app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "java"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "hmi-libra-dtu-stg"
      + resource_group_name                   = "hmi-sharedinfra-stg-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # azurerm_application_insights.rota_dtu_app_insights will be created
  + resource "azurerm_application_insights" "rota_dtu_app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "java"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "hmi-rota-dtu-stg"
      + resource_group_name                   = "hmi-sharedinfra-stg-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # azurerm_automation_account.automation_account will be created
  + resource "azurerm_automation_account" "automation_account" {
      + dsc_primary_access_key        = (sensitive value)
      + dsc_secondary_access_key      = (sensitive value)
      + dsc_server_endpoint           = (known after apply)
      + hybrid_service_url            = (known after apply)
      + id                            = (known after apply)
      + local_authentication_enabled  = true
      + location                      = "uksouth"
      + name                          = "hmi-stg-aa"
      + private_endpoint_connection   = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "hmi-sharedinfra-stg-rg"
      + sku_name                      = "Basic"
      + tags                          = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned, UserAssigned"
        }
    }

  # azurerm_key_vault_access_policy.apim_kv_policy will be created
  + resource "azurerm_key_vault_access_policy" "apim_kv_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "86edbf4a-d5aa-4a70-8137-a41ae3e62a62"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_role_assignment.mi_sa["Contributor"] will be created
  + resource "azurerm_role_assignment" "mi_sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_sa["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "mi_sa" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_runbook.main will be created
  + resource "azurerm_automation_runbook" "main" {
      + automation_account_name = "hmi-stg-aa"
      + content                 = <<-EOT
            Param(
            
              [string]$environment,
            
              [string]$resource_group_name,
              [string]$storage_account_name,
              [string]$container_name,
              [string]$blob_name,
            
              [string]$key_vault_name,
              [string]$secret_name,
            
              [string]$permissions, #might need to change type
              [int]$expiry_days,
              [int]$remaining_days,
            
              [bool]$bypass_akv_network,
              [string]$umi_client_id = ""
            
            )
            
            # Functions
            function checkExpiry([datetime]$expiry) {
              # Get difference between expiry current date and expiry date
              $time_dif = (($expiry) - (Get-Date))
            
              # If token needs renewed...
              if ($time_dif.Days -le $remaining_days) {
                return $true
              }
              else {
                return $false
              }
            
            }
            
            Function generateSAS() {
            
              param (
                $saName,
                $containerName,
                $blobName,
                $permissions,
                $expiry_date,
                $start_date
              )
              try {
                
                #Write-Output "Generating Token in SA $storage_account_name"
                Enable-AzureRmAlias
            	  $context = $(Get-AzStorageAccount -ResourceGroupName $resource_group_name -Name $storage_account_name).Context
                $storage_context = New-AzureStorageContext -ConnectionString $($context.ConnectionString)
            
                if ($containerName -and $blobName) {
                  try {
                    # Generate SAS token (blob name)
                    $sas_token = New-AzureStorageBlobSASToken -Container $containerName -Blob $blobName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Blob token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                
                }
                elseif ($containerName) {
                  try {
                    # Generate SAS token (container name)
                    $sas_token = New-AzureStorageContainerSASToken -Name $containerName -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Container token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
                else {
                  try {
                    # Generate SAS token (storage account)
                    $sas_token = New-AzureStorageAccountSASToken -Service Blob -ResourceType Service, Container, Object -Permission $permissions -StartTime $start_date -ExpiryTime $expiry_date -Context $storage_context
                    return $sas_token
                  }
                  catch {
                    Write-Error "Failed Generate Storage Account token. Aborting.";
                    Write-Error "Error: $($_)";
                    exit
                  }
                }
              }
              catch {
                Write-Error "Failed Generate Token. Aborting.";
                Write-Error "Error: $($_)";
                Disable-AzureRmAlias
                exit
              }
            
            }
            
            Function addSecretToKV() {
            
              param (
                $sasToken,
                $expiry_date,
                $start_date
              )
              try {
                $validity_period = [Timespan]($expiry_date - $start_Date)
                Write-Output "Validity period - $($validity_period)"
                Write-Output "Converting sas to secure string"
                $sas_secure = ConvertTo-SecureString $sasToken -AsPlainText -Force
            
                Write-Output "Adding sas to kv..."
                $secret = Set-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name -SecretValue $sas_secure -Expires $expiry_date -NotBefore $start_date
                Write-Output "Secret - $($secret | ConvertTo-Json)"
                Write-OutPut "Secret added to kv!"
              }
              catch {
                Write-Error "Failed Set Secrect. Aborting.";
                Write-Error "Error: $($_)";
                exit
              }
              
            }
            
            ##########################################################
            
            try {
            
              #Log in with MI
              Write-Output "Connecting with MI..."
              if($umi_client_id -ne ""){
                Write-Host "Using User-managed identity"
                Connect-AzAccount -Identity -accountId $umi_client_id
              } else {
                Connect-AzAccount -Identity
              }
            
              if($bypass_akv_network){
                $ip = Invoke-RestMethod -Uri api.ipify.org
                Write-host "Bypass required, add rule for $ip in $key_vault_name"
                Add-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
              }
            
              # Get secret
              Write-Output "Getting secret..."
              $secret = Get-AzKeyVaultSecret -VaultName $key_vault_name -Name $secret_name
              Write-Output "secret - $($secret | ConvertTo-Json)"
              $start_date = Get-Date
              $expiry_date = $start_date.AddDays($expiry_days)
            
              # Check if secret exists
              if ($secret -and $secret.Expires) {
                # Check expiry of secret
                if (checkExpiry($secret.Expires)) {
                  # Create new token
                  Write-Output "Secret needs renewed. Creating new token"
                  $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                  # Add token to kv
                  addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
            
                }
                else {
                  Write-Output "Secret does not need renewed."
                }
              }
              else {
                Write-Output "Secret does not exist. Creating secret."
                # Create token
                $sas = generateSAS -saName $storage_account_name -containerName $container_name -blobName $blob_name -permissions $permissions -resourceGroupName $resource_group_name -start_date $start_date -expiry_date $expiry_date
                # Add token to kv
                addSecretToKV -sasToken $sas -expiry_date $expiry_date -start_date $start_date
              }
            }
            catch {
              Write-Error "Failed to process. Aborting.";
              Write-Error "Error: $($_)";
              exit
            }
            
            if($bypass_akv_network){
              Write-host "Removing rule for $ip in $key_vault_name"
              Remove-AzKeyVaultNetworkRule -IpAddressRange $ip -VaultName $key_vault_name
            }
        EOT
      + description             = "This is a runbook to automate the recycling of SAS tokens on hmisastg"
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "uksouth"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "rotate-sas-tokens-hmisastg-rota-rl"
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_type            = "PowerShell"
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be created
  + resource "azurerm_automation_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + description             = "This is a schedule to automate the recycling of SAS to

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "hmi-sharedinfra-stg-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.kv_snl.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "hmi-kv-stg-shared-snl"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }

      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.sa.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = jsonencode(
            {
              + properties = {
                  + isEnabled                         = false
                  + malwareScanning                   = {
                      + onUpload = {
                          + capGBPerMonth = -1
                          + isEnabled     = false
                        }
                    }
                  + overrideSubscriptionLevelSettings = true
                  + sensitiveDataDiscovery            = {
                      + isEnabled = false
                    }
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.sa.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "storage-account-role-assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8e65726d-ee0f-46e7-9105-f97ab9f5e70b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sa.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = "Cool"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "RAGRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "hmisastg"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "hmi-sharedinfra-stg-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }

      + blob_properties {
          + change_feed_enabled      = true
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.sa.azurerm_storage_container.container["libra"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "libra"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.sa.azurerm_storage_container.container["processing"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "processing"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.sa.azurerm_storage_container.container["rota"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "rota"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "hmisastg"
    }

  # module.sa.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.sa.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.sa.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.snl_keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-snl-client-pwd"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "hmi-snl-client-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "hearings-management-interface"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 103 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Vars":{}} -->